{"keras_version": "2.2.0", "class_name": "Sequential", "config": [{"class_name": "Reshape", "config": {"trainable": true, "batch_input_shape": [null, 32, 1], "dtype": "float32", "name": "reshape_1", "target_shape": [32]}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "units": 16, "activation": "tanh", "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "units": 16, "activation": "tanh", "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_3", "units": 16, "activation": "tanh", "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_4", "units": 16, "activation": "tanh", "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_5", "units": 16, "activation": "tanh", "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_6", "units": 3, "activation": "linear", "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "activity_regularizer": null}}], "backend": "tensorflow"}