{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Reshape", "config": {"target_shape": [32], "trainable": true, "batch_input_shape": [null, 32, 1], "name": "reshape_1", "dtype": "float32"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "trainable": true, "units": 16, "name": "dense_1", "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "activity_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "trainable": true, "units": 16, "name": "dense_2", "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "activity_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "trainable": true, "units": 16, "name": "dense_3", "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "activity_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "trainable": true, "units": 16, "name": "dense_4", "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "activity_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "trainable": true, "units": 16, "name": "dense_5", "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "activity_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "trainable": true, "units": 3, "name": "dense_6", "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "kernel_regularizer": null}}], "keras_version": "2.2.0"}