{"backend": "tensorflow", "keras_version": "2.2.0", "class_name": "Sequential", "config": [{"class_name": "Reshape", "config": {"trainable": true, "dtype": "float32", "name": "reshape_1", "target_shape": [32], "batch_input_shape": [null, 32, 1]}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activation": "tanh", "units": 16, "use_bias": true, "activity_regularizer": null, "name": "dense_1", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activation": "tanh", "units": 16, "use_bias": true, "activity_regularizer": null, "name": "dense_2", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activation": "tanh", "units": 16, "use_bias": true, "activity_regularizer": null, "name": "dense_3", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activation": "tanh", "units": 16, "use_bias": true, "activity_regularizer": null, "name": "dense_4", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activation": "tanh", "units": 16, "use_bias": true, "activity_regularizer": null, "name": "dense_5", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activation": "linear", "units": 3, "use_bias": true, "activity_regularizer": null, "name": "dense_6", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}]}