{"keras_version": "2.2.0", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Reshape", "config": {"dtype": "float32", "name": "reshape_1", "batch_input_shape": [null, 32, 1], "target_shape": [32], "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_constraint": null, "units": 16, "kernel_regularizer": null, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "tanh", "bias_regularizer": null, "activity_regularizer": null, "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_constraint": null, "units": 16, "kernel_regularizer": null, "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "tanh", "bias_regularizer": null, "activity_regularizer": null, "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_constraint": null, "units": 16, "kernel_regularizer": null, "name": "dense_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "tanh", "bias_regularizer": null, "activity_regularizer": null, "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_constraint": null, "units": 16, "kernel_regularizer": null, "name": "dense_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "tanh", "bias_regularizer": null, "activity_regularizer": null, "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_constraint": null, "units": 16, "kernel_regularizer": null, "name": "dense_5", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "tanh", "bias_regularizer": null, "activity_regularizer": null, "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_constraint": null, "units": 3, "kernel_regularizer": null, "name": "dense_6", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "linear", "bias_regularizer": null, "activity_regularizer": null, "trainable": true}}]}