{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Reshape", "config": {"name": "reshape_1", "target_shape": [40, 2], "dtype": "float32", "batch_input_shape": [null, 40, 2], "trainable": true}}, {"class_name": "Conv1D", "config": {"bias_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "padding": "valid", "kernel_size": [3], "strides": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "dilation_rate": [1], "name": "conv1d_1", "kernel_constraint": null, "activation": "relu", "data_format": "channels_last", "filters": 16}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_1", "padding": "valid", "pool_size": [2], "strides": [2], "trainable": true}}, {"class_name": "Conv1D", "config": {"bias_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "padding": "valid", "kernel_size": [3], "strides": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "dilation_rate": [1], "name": "conv1d_2", "kernel_constraint": null, "activation": "relu", "data_format": "channels_last", "filters": 16}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_2", "padding": "valid", "pool_size": [2], "strides": [2], "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}}, {"class_name": "Dense", "config": {"bias_constraint": null, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": true, "name": "dense_1", "kernel_constraint": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 48}}, {"class_name": "Dense", "config": {"bias_constraint": null, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": true, "name": "dense_2", "kernel_constraint": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 24}}, {"class_name": "Dense", "config": {"bias_constraint": null, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": true, "name": "dense_3", "kernel_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 3}}], "keras_version": "2.2.0"}