{"backend": "tensorflow", "config": [{"config": {"dtype": "float32", "batch_input_shape": [null, 32, 1], "name": "reshape_1", "trainable": true, "target_shape": [32]}, "class_name": "Reshape"}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_constraint": null, "units": 16, "activation": "tanh"}, "class_name": "Dense"}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "name": "dense_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_constraint": null, "units": 16, "activation": "tanh"}, "class_name": "Dense"}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "name": "dense_3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_constraint": null, "units": 16, "activation": "tanh"}, "class_name": "Dense"}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "name": "dense_4", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_constraint": null, "units": 16, "activation": "tanh"}, "class_name": "Dense"}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "name": "dense_5", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_constraint": null, "units": 16, "activation": "tanh"}, "class_name": "Dense"}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "name": "dense_6", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_constraint": null, "units": 3, "activation": "linear"}, "class_name": "Dense"}], "keras_version": "2.2.0", "class_name": "Sequential"}