{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Reshape", "config": {"name": "reshape_1", "dtype": "float32", "target_shape": [32], "trainable": true, "batch_input_shape": [null, 32, 1]}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 16, "bias_regularizer": null, "activity_regularizer": null, "name": "dense_1", "trainable": true, "activation": "tanh", "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 16, "bias_regularizer": null, "activity_regularizer": null, "name": "dense_2", "trainable": true, "activation": "tanh", "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 16, "bias_regularizer": null, "activity_regularizer": null, "name": "dense_3", "trainable": true, "activation": "tanh", "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 16, "bias_regularizer": null, "activity_regularizer": null, "name": "dense_4", "trainable": true, "activation": "tanh", "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 16, "bias_regularizer": null, "activity_regularizer": null, "name": "dense_5", "trainable": true, "activation": "tanh", "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 3, "bias_regularizer": null, "activity_regularizer": null, "name": "dense_6", "trainable": true, "activation": "linear", "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}], "keras_version": "2.2.0"}