{"keras_version": "2.2.0", "config": [{"config": {"name": "reshape_1", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 32, 1], "target_shape": [32]}, "class_name": "Reshape"}, {"config": {"units": 16, "bias_constraint": null, "use_bias": true, "activation": "tanh", "name": "dense_1", "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activity_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"units": 16, "bias_constraint": null, "use_bias": true, "activation": "tanh", "name": "dense_2", "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activity_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"units": 16, "bias_constraint": null, "use_bias": true, "activation": "tanh", "name": "dense_3", "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activity_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"units": 16, "bias_constraint": null, "use_bias": true, "activation": "tanh", "name": "dense_4", "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activity_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"units": 16, "bias_constraint": null, "use_bias": true, "activation": "tanh", "name": "dense_5", "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activity_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"units": 3, "bias_constraint": null, "use_bias": true, "activation": "linear", "name": "dense_6", "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activity_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential"}