{"class_name": "Sequential", "config": [{"class_name": "Reshape", "config": {"name": "reshape_1", "batch_input_shape": [null, 40, 1], "target_shape": [40], "dtype": "float32", "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "trainable": true, "name": "dense_1", "bias_constraint": null, "units": 16, "activation": "tanh", "activity_regularizer": null}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "trainable": true, "name": "dense_2", "bias_constraint": null, "units": 16, "activation": "tanh", "activity_regularizer": null}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "trainable": true, "name": "dense_3", "bias_constraint": null, "units": 16, "activation": "tanh", "activity_regularizer": null}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "trainable": true, "name": "dense_4", "bias_constraint": null, "units": 16, "activation": "tanh", "activity_regularizer": null}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "trainable": true, "name": "dense_5", "bias_constraint": null, "units": 16, "activation": "tanh", "activity_regularizer": null}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "trainable": true, "name": "dense_6", "bias_constraint": null, "units": 3, "activation": "linear", "activity_regularizer": null}}], "keras_version": "2.2.0", "backend": "tensorflow"}