{"class_name": "Sequential", "config": [{"class_name": "Reshape", "config": {"trainable": true, "name": "reshape_1", "dtype": "float32", "target_shape": [40], "batch_input_shape": [null, 40, 1]}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "use_bias": true, "activation": "tanh", "bias_constraint": null, "units": 16, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "use_bias": true, "activation": "tanh", "bias_constraint": null, "units": 16, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "use_bias": true, "activation": "tanh", "bias_constraint": null, "units": 16, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "use_bias": true, "activation": "tanh", "bias_constraint": null, "units": 16, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_5", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "use_bias": true, "activation": "tanh", "bias_constraint": null, "units": 16, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_6", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "use_bias": true, "activation": "linear", "bias_constraint": null, "units": 3, "activity_regularizer": null}}], "backend": "tensorflow", "keras_version": "2.2.0"}