{"backend": "tensorflow", "config": [{"config": {"name": "reshape_1", "batch_input_shape": [null, 32, 1], "dtype": "float32", "trainable": true, "target_shape": [32]}, "class_name": "Reshape"}, {"config": {"bias_regularizer": null, "units": 16, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh", "activity_regularizer": null, "name": "dense_1", "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "units": 16, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh", "activity_regularizer": null, "name": "dense_2", "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "units": 16, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh", "activity_regularizer": null, "name": "dense_3", "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "units": 16, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh", "activity_regularizer": null, "name": "dense_4", "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "units": 16, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh", "activity_regularizer": null, "name": "dense_5", "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "units": 3, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "activity_regularizer": null, "name": "dense_6", "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.2.0"}