{"backend": "tensorflow", "config": [{"config": {"name": "reshape_1", "trainable": true, "target_shape": [32], "batch_input_shape": [null, 32, 1], "dtype": "float32"}, "class_name": "Reshape"}, {"config": {"units": 16, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "name": "dense_1", "activation": "tanh", "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"units": 16, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "name": "dense_2", "activation": "tanh", "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"units": 16, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "name": "dense_3", "activation": "tanh", "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"units": 16, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "name": "dense_4", "activation": "tanh", "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"units": 16, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "name": "dense_5", "activation": "tanh", "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"units": 3, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "name": "dense_6", "activation": "linear", "kernel_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.2.0"}