{"keras_version": "2.2.0", "class_name": "Sequential", "config": [{"class_name": "Reshape", "config": {"name": "reshape_1", "trainable": true, "target_shape": [1440, 1], "dtype": "float32", "batch_input_shape": [null, 1440, 1]}}, {"class_name": "Conv1D", "config": {"data_format": "channels_last", "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "strides": [1], "dilation_rate": [1], "padding": "valid", "name": "conv1d_1", "trainable": true, "kernel_regularizer": null, "activation": "relu", "kernel_constraint": null, "bias_constraint": null, "kernel_size": [3], "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "name": "max_pooling1d_1", "trainable": true, "strides": [2], "pool_size": [2]}}, {"class_name": "Conv1D", "config": {"data_format": "channels_last", "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "strides": [1], "dilation_rate": [1], "padding": "valid", "name": "conv1d_2", "trainable": true, "kernel_regularizer": null, "activation": "relu", "kernel_constraint": null, "bias_constraint": null, "kernel_size": [3], "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "name": "max_pooling1d_2", "trainable": true, "strides": [2], "pool_size": [2]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "name": "dense_1", "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "kernel_constraint": null, "units": 48, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "name": "dense_2", "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "kernel_constraint": null, "units": 24, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "name": "dense_3", "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null, "units": 3, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "backend": "tensorflow"}