{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.0", "config": [{"class_name": "Reshape", "config": {"dtype": "float32", "trainable": true, "name": "reshape_1", "target_shape": [40, 1], "batch_input_shape": [null, 40, 1]}}, {"class_name": "Conv1D", "config": {"dilation_rate": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3], "bias_regularizer": null, "name": "conv1d_1", "strides": [1], "filters": 16, "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "use_bias": true}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "padding": "valid", "name": "max_pooling1d_1", "pool_size": [2], "strides": [2]}}, {"class_name": "Conv1D", "config": {"dilation_rate": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3], "bias_regularizer": null, "name": "conv1d_2", "strides": [1], "filters": 16, "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "use_bias": true}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "padding": "valid", "name": "max_pooling1d_2", "pool_size": [2], "strides": [2]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "dense_1", "trainable": true, "activity_regularizer": null, "bias_constraint": null, "units": 48, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": true}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "dense_2", "trainable": true, "activity_regularizer": null, "bias_constraint": null, "units": 24, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": true}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "dense_3", "trainable": true, "activity_regularizer": null, "bias_constraint": null, "units": 3, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": true}}]}