{"keras_version": "2.2.0", "config": [{"class_name": "Reshape", "config": {"batch_input_shape": [null, 32, 1], "target_shape": [32], "dtype": "float32", "trainable": true, "name": "reshape_1"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "trainable": true, "activation": "tanh", "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": true, "units": 16, "name": "dense_1"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "trainable": true, "activation": "tanh", "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": true, "units": 16, "name": "dense_2"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "trainable": true, "activation": "tanh", "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": true, "units": 16, "name": "dense_3"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "trainable": true, "activation": "tanh", "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": true, "units": 16, "name": "dense_4"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "trainable": true, "activation": "tanh", "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": true, "units": 16, "name": "dense_5"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "trainable": true, "activation": "linear", "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": true, "units": 3, "name": "dense_6"}}], "class_name": "Sequential", "backend": "tensorflow"}