{"backend": "tensorflow", "keras_version": "2.2.0", "config": [{"config": {"trainable": true, "batch_input_shape": [null, 1440, 1], "dtype": "float32", "target_shape": [1440], "name": "reshape_1"}, "class_name": "Reshape"}, {"config": {"trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "activation": "tanh", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "units": 16, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "activation": "tanh", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "units": 16, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_2"}, "class_name": "Dense"}, {"config": {"trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "activation": "tanh", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "units": 16, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_3"}, "class_name": "Dense"}, {"config": {"trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "activation": "tanh", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "units": 16, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_4"}, "class_name": "Dense"}, {"config": {"trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "activation": "tanh", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "units": 16, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_5"}, "class_name": "Dense"}, {"config": {"trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "units": 3, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_6"}, "class_name": "Dense"}], "class_name": "Sequential"}